Revit 2027 API
BuiltInFailures.FabricFailures.CannotPlaceFabricAreaWarn Property
 Can't find a host for Fabric Area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceFabricAreaWarn { get; }
Public Shared ReadOnly Property CannotPlaceFabricAreaWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceFabricAreaWarn {
	FailureDefinitionId^ get ();
}
static member CannotPlaceFabricAreaWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace